2024/AoCyber/01.md

From https://github.com/Bloatware-WarevilleTHM/C2-Server/blob/main/app.py we get that the server runs at port 8000
access on port 8000 the aoc attacker server

Launch the Flask server locally with secret to get session cookie, and inject the local session cookie into the server. Get dashboard, and boom key

T1 keycard: vK5RMlvkGO3QiLU

Password attacker used: Form item: "confirm_password" = "QU9DMjAyNHtUaW55X1R" (no 153213)

Form item: "password" = "pbnlfVGlueV9TaDNsbF"

POST /sdk
<soap:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><operationID>00000001-00000001</operationID></soap:Header><soap:Body><RetrieveServiceContent xmlns="urn:internalvim25"><_this xsi:type="ManagedObjectReference" type="ServiceInstance">ServiceInstance</_this></RetrieveServiceContent></soap:Body></soap:Envelope>

X-Aws-Ec2-Metadata-Token: AQAEAJP70DM0por1AkT1t1eEjOR-UqiEpibtiAy2PKo5l5rj9C7pAg==

10.10.103.220 (Web)
10.13.44.207 (Attacker)

GET /exp_file_credential on attacker

GET /ff on attacker (ELF backdoor)